Merge pull request #2 from mamonth/feature/cleanup-and-fix-docs
Documentation cleanup & minor fixes
